; domain
; This is a new custom planner for a pick and place task

(define (domain tabletop-skill)
  (:requirements :strips :typing)
  (:types block table bin)
  (:predicates
    (block ?b)                         ; ?b is a block
    (table ?t)                         ; ?t is a table
    (bin ?x)                           ; ?x is a bin
    (on-table ?b ?t)                   ; block ?b is on table ?t
    (in-bin ?b ?x)                     ; block ?b is in bin ?x
    (arm-free)                         ; the robot arm is free and not holding anything
    (holding ?b)                       ; arm is currently holding block ?b.
    (red ?b)                           
    (blue ?b)                          
    (green ?b)                         
  )

  ;; PICK: picks up a block from the table.
  (:action pick
    :parameters (?b - block ?t - table)
    :precondition (and (on-table ?b ?t) (arm-free))
    :effect (and (holding ?b)
                 (not (arm-free))
                 (not (on-table ?b ?t)))
  )



  ;; PLACE: places a block into the bin on the table
  (:action place
    :parameters (?b - block ?x - bin)
    :precondition (and (holding ?b))
    :effect (and (in-bin ?b ?x)
                 (arm-free)
                 (not (holding ?b)))
  )
)

; problem
(define (problem skill-put-blocks-bin)
  (:domain tabletop-skill)
  (:objects
    red blue green - block   ; The three colored blocks.
    table1 - table           ; The tabletop.
    bin1 - bin               ; The bin on the right side.
  )
  (:init
    (table table1)                ; Declare table1 as a table.
    (bin bin1)                    ; Declare bin1 as a bin.
    (arm-free)                    ; The robot arm starts free.
    (on-table red table1)         ; Red block is initially on table1.
    (on-table blue table1)        ; Blue block is initially on table1.
    (on-table green table1)       ; Green block is initially on table1.
  )
  (:goal (and
           (in-bin red bin1)      ; Red block must be in the bin.
           (in-bin blue bin1)     ; Blue block must be in the bin.
           (in-bin green bin1)    ; Green block must be in the bin.
  ))
)

; plan
1. (pick green table1)
   deleted: (arm-free) (on-table green table1)
   added: (holding green)
   goals met: 0 of 3
2. (place green bin1)
   deleted: (holding green)
   added: (in-bin green bin1) (arm-free)
   goals met: 1 of 3
3. (pick red table1)
   deleted: (arm-free) (on-table red table1)
   added: (holding red)
   goals met: 1 of 3
4. (place red bin1)
   deleted: (holding red)
   added: (in-bin red bin1) (arm-free)
   goals met: 2 of 3
5. (pick blue table1)
   deleted: (arm-free) (on-table blue table1)
   added: (holding blue)
   goals met: 2 of 3
6. (place blue bin1)
   deleted: (holding blue)
   added: (in-bin blue bin1) (arm-free)
   goals met: 3 of 3
